---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.SpaceSet.Size
source: html/1d4ff085-118a-9941-2079-a28e237c2093.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSet.Size Property

Returns the number of objects that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```